Repository: NicolaLS/payment-app
Catalog: providers/nwc/feature/wallet-connection/src/iosMain/resources/LasrWalletConnection.xcstrings
Source language: en
Languages: de, es

# add_wallet_description
source: Copy a NWC URI and come back here, or scan the QR code.
de: Kopiere eine NWC-URI und kehre hierher zurück oder scanne den QR-Code.
es: Copia un URI de NWC y regresa aquí, o escanea el código QR.

# add_wallet_scan_allow_camera
source: Allow Camera Access
de: Kamerazugriff erlauben
es: Permitir acceso a la cámara

# add_wallet_scan_instruction
source: Align the QR code within the frame.
de: Richte den QR-Code im Rahmen aus.
es: Alinea el código QR dentro del marco.

# add_wallet_scan_open_settings
source: Open Settings
de: Einstellungen öffnen
es: Abrir Ajustes

# add_wallet_scan_permission
source: Camera access is required to scan QR codes.
de: Für das Scannen von QR-Codes ist Kamerazugriff erforderlich.
es: Se necesita acceso a la cámara para escanear códigos QR.

# add_wallet_scan_restricted
source: Camera access is unavailable because of this device’s restrictions.
de: Der Kamerazugriff ist aufgrund der Einschränkungen dieses Geräts nicht verfügbar.
es: El acceso a la cámara no está disponible debido a las restricciones de este dispositivo.

# add_wallet_scan_retry
source: Try Again
de: Erneut versuchen
es: Intentar de nuevo

# add_wallet_title
source: Connect Wallet
de: Wallet verbinden
es: Conectar billetera

# add_wallet_uri_paste
source: Paste from clipboard
de: Aus Zwischenablage einfügen
es: Pegar desde el portapapeles

# add_wallet_uri_placeholder
source: nostr+walletconnect://your-wallet-public-key?relay=…
de: nostr+walletconnect://dein-wallet-public-key?relay=…
es: nostr+walletconnect://tu-wallet-public-key?relay=…

# connect_wallet_cancel
source: Cancel
de: Abbrechen
es: Cancelar

# connect_wallet_confirm
source: Add Wallet
de: Wallet hinzufügen
es: Añadir billetera

# connect_wallet_description
source: Review the wallet details before connecting.
de: Überprüfe die Wallet-Details, bevor du die Verbindung herstellst.
es: Revisa los detalles de la billetera antes de conectarla.

# connect_wallet_details_encryption
source: Supported encryption
de: Unterstützte Verschlüsselung
es: Cifrado compatible

# connect_wallet_details_encryption_active
source: Active encryption: %1$@
de: Aktive Verschlüsselung: %1$@
es: Cifrado activo: %1$@

# connect_wallet_details_lud16
source: Lightning address
de: Lightning-Adresse
es: Dirección Lightning

# connect_wallet_details_methods
source: Supported methods
de: Unterstützte Methoden
es: Métodos compatibles

# connect_wallet_details_pubkey
source: Wallet public key
de: Öffentlicher Wallet-Schlüssel
es: Clave pública de la billetera

# connect_wallet_details_relay
source: Primary relay
de: Primäres Relay
es: Relé principal

# connect_wallet_loading
source: Fetching wallet information…
de: Wallet-Informationen werden abgerufen…
es: Obteniendo información de la billetera…

# connect_wallet_required_methods
source: %1$@ requires both pay_invoice and lookup_invoice before this connection can be saved.
de: %1$@ benötigt pay_invoice und lookup_invoice, bevor diese Verbindung gespeichert werden kann.
es: %1$@ requiere pay_invoice y lookup_invoice antes de guardar esta conexión.

# connect_wallet_retry
source: Retry
de: Erneut versuchen
es: Reintentar

# connect_wallet_title
source: Add Wallet
de: Wallet hinzufügen
es: Añadir billetera

# connect_wallet_warning_heading
source: Review before connecting
de: Vor dem Verbinden überprüfen
es: Revisa antes de conectar

# connect_wallet_warning_legacy_nip04
source: This wallet only supports legacy NIP-04 encryption. Requests will work, but encryption is weaker than NIP-44.
de: Diese Wallet unterstützt nur die veraltete NIP-04-Verschlüsselung. Anfragen funktionieren, aber die Verschlüsselung ist schwächer als NIP-44.
es: Esta billetera solo admite el cifrado heredado NIP-04. Las solicitudes funcionarán, pero el cifrado es más débil que NIP-44.

# connect_wallet_warning_legacy_nip04_default
source: This wallet did not advertise an encryption scheme. We'll assume legacy NIP-04, which offers weaker protection than NIP-44.
de: Diese Wallet hat kein Verschlüsselungsverfahren angekündigt. Wir nehmen die veraltete NIP-04-Verschlüsselung an, die schwächeren Schutz als NIP-44 bietet.
es: Esta billetera no anunció un esquema de cifrado. Asumiremos NIP-04 heredado, que ofrece una protección más débil que NIP-44.

# connect_wallet_warning_missing_lookup_invoice
source: This wallet does not advertise lookup_invoice. %1$@ needs it to safely resolve delayed payments.
de: Diese Wallet kündigt lookup_invoice nicht an. %1$@ benötigt die Methode, um verzögerte Zahlungen sicher zu klären.
es: Esta billetera no anuncia lookup_invoice. %1$@ lo necesita para resolver pagos demorados de forma segura.

# connect_wallet_warning_missing_nip44
source: This wallet does not advertise modern NIP-44 encryption. We'll use legacy encryption if available, which is less secure.
de: Diese Wallet kündigt keine moderne NIP-44-Verschlüsselung an. Falls verfügbar, verwenden wir die weniger sichere Legacy-Verschlüsselung.
es: Esta billetera no anuncia cifrado NIP-44 moderno. Usaremos el cifrado heredado si está disponible, que es menos seguro.

# connect_wallet_warning_missing_pay_invoice
source: This wallet does not advertise the pay_invoice capability. Payments will fail.
de: Diese Wallet kündigt die Funktion pay_invoice nicht an. Zahlungen werden fehlschlagen.
es: Esta billetera no anuncia la capacidad pay_invoice. Los pagos fallarán.

# error_invalid_wallet_uri
source: This wallet URI isn't valid. Please double-check and try again.
de: Diese Wallet-URI ist ungültig. Bitte überprüfe sie und versuche es erneut.
es: La URI de la billetera no es válida. Verifícala e inténtalo de nuevo.

# error_relay_connection_failed
source: Could not connect to wallet. Try again.
de: Verbindung zum Wallet fehlgeschlagen. Bitte erneut versuchen.
es: No se pudo conectar a la billetera. Inténtalo de nuevo.

# error_wallet_already_connected
source: Disconnect your current wallet before connecting another.
de: Trenne deine aktuelle Wallet, bevor du eine andere verbindest.
es: Desconecta tu billetera actual antes de conectar otra.

# keyboard_done
source: Done
de: Fertig
es: Listo

# add_wallet_uri_label
source: Wallet Connect URI
es: URI de Wallet Connect

# connect_wallet_alias_label
source: Wallet alias (optional)
es: Alias de la billetera (opcional)
